; domain
(define (domain mytrajectoryconstraintsremover_minigrid_problem-domain)
 (:requirements :strips :typing :negative-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 key ball box - object_
 )
 (:constants
   empty - empty_0
   green_door_1 - door
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and (at_ ?obj)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and (at_ empty)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and (at_ ?door)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (and (not (emptyhands)) (= ?door green_door_1)) (hold_0)) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (when (at_ green_door_1) (hold_0)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem mytrajectoryconstraintsremover_minigrid_problem-problem)
 (:domain mytrajectoryconstraintsremover_minigrid_problem-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   grey_door_1 yellow_door_1 grey_door_2 - door
   grey_key_2 grey_key_3 yellow_key_1 grey_key_4 green_key_1 green_key_2 grey_key_1 yellow_key_2 - key
   blue_ball_1 - ball
   purple_box_1 - box
 )
 (:init (agentinroom room_4) (objectinroom yellow_key_1 room_1) (objectinroom grey_key_1 room_1) (objectinroom grey_key_2 room_2) (objectinroom green_key_1 room_2) (objectinroom purple_box_1 room_3) (objectinroom yellow_key_2 room_3) (objectinroom grey_key_3 room_3) (objectinroom blue_ball_1 room_4) (objectinroom green_key_2 room_4) (objectinroom grey_key_4 room_4) (objectcolor yellow_key_1 yellowtype) (objectcolor grey_key_1 greytype) (objectcolor grey_key_2 greytype) (objectcolor green_key_1 greentype) (objectcolor purple_box_1 purpletype) (objectcolor yellow_key_2 yellowtype) (objectcolor grey_key_3 greytype) (objectcolor blue_ball_1 bluetype) (objectcolor green_key_2 greentype) (objectcolor grey_key_4 greytype) (objectcolor grey_door_1 greytype) (objectcolor yellow_door_1 yellowtype) (objectcolor green_door_1 greentype) (objectcolor grey_door_2 greytype) (emptyhands) (locked grey_door_1) (locked yellow_door_1) (locked green_door_1) (locked grey_door_2) (adjacentrooms room_2 room_1 grey_door_1) (adjacentrooms room_1 room_2 grey_door_1) (adjacentrooms room_3 room_1 yellow_door_1) (adjacentrooms room_1 room_3 yellow_door_1) (adjacentrooms room_4 room_2 green_door_1) (adjacentrooms room_2 room_4 green_door_1) (adjacentrooms room_4 room_3 grey_door_2) (adjacentrooms room_3 room_4 grey_door_2) (visited room_4) (= (total-cost) 0))
 (:goal (and (exists (?v - key)
 (and (objectcolor ?v yellowtype) (at_ ?v))) (hold_0)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor grey_door_2 room_4 room_3)
   added: (at_ grey_door_2)
   goals met: 0 of 2
2. (toggle grey_door_2)
   deleted: (locked grey_door_2)
   goals met: 0 of 2
3. (gotoobject blue_ball_1 room_4)
   deleted: (at_ grey_door_2)
   added: (at_ blue_ball_1)
   goals met: 0 of 2
4. (pick blue_ball_1 room_4)
   deleted: (at_ blue_ball_1) (emptyhands) (objectinroom blue_ball_1 room_4)
   added: (carrying blue_ball_1)
   goals met: 0 of 2
5. (gotodoor green_door_1 room_4 room_2)
   added: (at_ green_door_1) (hold_0)
   goals met: 1 of 2
6. (gotoroom room_4 room_3 grey_door_2)
   deleted: (agentinroom room_4) (at_ green_door_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 1 of 2
7. (gotoobject yellow_key_2 room_3)
   added: (at_ yellow_key_2)
   goals met: 2 of 2
